In [64]:
import numpy as np
import pandas as pd

df = pd.DataFrame({
        'Math': [30, 40, 50, 60, 70, 80, np.nan], 
        'Science': [35,45,60,70,25,80,90]
}, index=['s1', 's2', 's3', 's4', '55', '66', 's7'])

In [65]:
df.select_dtypes(include=np.number)

    Math  Science
s1  30.0       35
s2  40.0       45
s3  50.0       60
s4  60.0       70
55  70.0       25
66  80.0       80
s7   NaN       90

In [66]:
df1 = df
# df1.columns = df.columns + '_n'
df1.columns

Index(['Math', 'Science'], dtype='object')

In [67]:
df = df.rename({'55':'s5', '66':'s6'}) # rename the index 55 and 66 to s5 and s6

In [68]:
df[df.Math.notnull()] # remove values from df.Math if its null

    Math  Science
s1  30.0       35
s2  40.0       45
s3  50.0       60
s4  60.0       70
s5  70.0       25
s6  80.0       80

In [69]:
df = pd.DataFrame({'name':['a','b','c'], 'score':[20, 30,40]})
df

  name  score
0    a     20
1    b     30
2    c     40

In [ ]:
indexes = ['row1', 'row2', 'row3']
df.index = indexes

df

     name  score
row1    a     20
row2    b     30
row3    c     40

In [75]:
df1 = df.T
df1

      row1 row2 row3
name     a    b    c
score   20   30   40

In [80]:
import numpy as np
import pandas as pd

df = pd.DataFrame({'name':['a','b','c'], 'score':[20, 30,40]})

indexes = ['row1', 'row2', 'row3']
df.index = indexes

df1 = df.T
df2 = df.transpose()

print(df1, "\n")
print(df2)

      row1 row2 row3
name     a    b    c
score   20   30   40

      row1 row2 row3
name     a    b    c
score   20   30   40

In [88]:
df1 = pd.DataFrame({'name': ['sachin', 'virat', 'sourav'], 'wickets': [98, 97, 96], 'year': [1990, 2000, 2010]})

df2 = pd.DataFrame({'name': ['jack', 'robert', 'adam'], 'wickets': [90, 95, 92], 'year': [1990, 2000, 2010]})

df3 = pd.concat([df1, df2], axis=0)
df4 = pd.concat([df1, df2], axis=1)

print(df3)

print()
print(df4)

     name  wickets  year
0  sachin       98  1990
1   virat       97  2000
2  sourav       96  2010
0    jack       90  1990
1  robert       95  2000
2    adam       92  2010

     name  wickets  year    name  wickets  year
0  sachin       98  1990    jack       90  1990
1   virat       97  2000  robert       95  2000
2  sourav       96  2010    adam       92  2010